# Flow Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSection..::..Flow Property
MEPSection Class See Also
---
The flow of the section.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double Flow { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Flow As Double
	Get
```

Visual C++
---
```text
public:
property double Flow {
	double get ();
}
```

# Remarks
In one section, all section members have same flow. Default unit is Cubic feet per second. For Duct, unit type is UT_HVAC_Airflow. For Pipe, unit type is UT_Piping_Flow
# See Also
MEPSection Class
Autodesk.Revit.DB.Mechanical Namespace